Tekla.Structures.AnalysisInternal.DotAnalysisModel
The serialization structure for AnalysisModel.

Tekla.Structures.AnalysisInternal.DotAnalysisModel._AnalysisObject
The analysis object instance.

Tekla.Structures.AnalysisInternal.DotAnalysisModel._ConstructionMethod
The construction method of the analysis model.

Tekla.Structures.AnalysisInternal.DotAnalysisModel._FilterName
The filter name of the analysis model.

Tekla.Structures.AnalysisInternal.DotAnalysisModel._AnalysisMethod
The analysis method of the analysis model.

Tekla.Structures.AnalysisInternal.DotAnalysisModel._AnalysisEngine
The analysis engine of the analysis model.

Tekla.Structures.AnalysisInternal.DotAnalysisModel._UseModelMerge
This indicates whether model merge is used.

Tekla.Structures.AnalysisInternal.DotAnalysisModel._NumberOfIterations
The number of iterations of the analysis model.

Tekla.Structures.AnalysisInternal.DotAnalysisModel._IncludeImperfections
This indicates whether imperfections are to be included.

Tekla.Structures.AnalysisInternal.DotAnalysisModel._RelativeAccuracy
The relative accuracy of the analysis model.

Tekla.Structures.AnalysisInternal.DotAnalysisModel._ModelUpdateModificationIdentifier
The identifier of th emodel update modification.

Tekla.Structures.AnalysisInternal.DotAnalysisModel._ResultsModificationIdentifier
The identifier of the results modification.

Tekla.Structures.AnalysisInternal.DotAnalysisModel._ResultsTime
The time of the results.

Tekla.Structures.AnalysisInternal.DotAnalysisModel._ResultsFrozen
This indicates whether the results are frozen.

Tekla.Structures.AnalysisInternal.DotAnalysisModel._PhysicalFrozen
This indicates whether the physical objects are frozen.

Tekla.Structures.AnalysisInternal.DotAnalysisModel._BracingFilterName
The bracing filter name.

Tekla.Structures.AnalysisInternal.DotAnalysisModel._SecondaryFilterName
The secondary filter name.

Tekla.Structures.AnalysisInternal.DotAnalysisModel._NodePositionTolerance
The node position tolerance of the analysis model.

Tekla.Structures.AnalysisInternal.DotAnalysisModel._SnapDistance
The snap distance of the analysis model.

Tekla.Structures.AnalysisInternal.DotAnalysisModel._UseTrueCurvedMembers
This indicates whether members are true curved.

Tekla.Structures.AnalysisInternal.DotAnalysisModel._UseTwinProfiles
This indicates whether twin profiles are used.

Tekla.Structures.AnalysisInternal.DotAnalysisModel._MemberAxislocation
The axis location of the members.

Tekla.Structures.AnalysisInternal.DotAnalysisModel._MemberEndReleaseMethodByJoint
This indicates whether the endreleases are set by joint.

Tekla.Structures.AnalysisInternal.DotAnalysisModel.ToStruct(Tekla.Structures.Analysis.AnalysisModel)
DO NOT USE! For internal usage only!
P: P.

Tekla.Structures.AnalysisInternal.DotAnalysisModel.FromStruct(Tekla.Structures.Analysis.AnalysisModel)
DO NOT USE! For internal usage only!
P: P.